; domain
(define (domain restaurantA)
	(:requirements :strips :adl :typing :fluents)

	(:types
		robot - object
		customer - object
		plate - object
		location
	)

	(:predicates
		(at ?obj - object ?loc - location)
		(adjacent ?loc1 - location ?loc2 - location)
		(hasFood ?p - plate)
		(hasPlate ?r - robot)
		(holding ?r - robot ?p - plate)
		(served ?c - customer)
		(buffet ?loc - location)
	)

	(:action pick-up
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(at ?p ?loc)
			(not (hasPlate ?r))
		)
		:effect (and
			(holding ?r ?p)
			(hasPlate ?r)
		)
	)

	(:action present
		:parameters (?r - robot ?p - plate ?loc - location ?c - customer)
		:precondition (and
			(at ?c ?loc)
			(at ?r ?loc)
			(holding ?r ?p)
			(hasFood ?p)
			(not (served ?c))
		)
		:effect (and
			(served ?c)
			(not (holding ?r ?p))
			(not (hasPlate ?r))
		)
	)

	(:action fill
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(buffet ?loc)
			(holding ?r ?p)
			(not (hasFood ?p))
		)
		:effect (and
			(hasFood ?p)
		)
	)

	(:action move
		:parameters (?r - robot ?loc1 - location ?loc2 - location)
		:precondition (and
			(at ?r ?loc1)
			(adjacent ?loc1 ?loc2)
			(not (hasPlate ?r))
		)
		:effect (and
			(at ?r ?loc2)
			(not (at ?r ?loc1))
		)
	)

	(:action move_plate
		:parameters (?r - robot ?p - plate ?loc1 - location ?loc2 - location)
		:precondition (and
			(at ?r ?loc1)
			(adjacent ?loc1 ?loc2)
			(holding ?r ?p)
		)
		:effect (and
			(at ?r ?loc2)
			(not (at ?r ?loc1))
			(at ?p ?loc2)
			(not (at ?p ?loc1))
		)
	)
)

; problem
(define (problem problem0)
  (:domain restaurantA)
  
  ;; Define objects

  (:objects
    robot - robot
    plate1 - plate
    customer1 - customer
    BTA AMA AUA PLA PMA PUA ALA - location
  )
  
  (:init

    ;; Robot initialization

    (at robot BTA)

    ;; Plate initialization

    (at plate1 BTA)

    ;; Customer initialization

    (at customer1 PMA)

    ;; Define adjacent rooms

    (adjacent BTA AUA) (adjacent AUA BTA)
    (adjacent AUA AMA) (adjacent AMA AUA)
    (adjacent AUA PUA) (adjacent PUA AUA)
    (adjacent PUA PMA) (adjacent PMA PUA)
    (adjacent PMA PLA) (adjacent PLA PMA)
    (adjacent AMA ALA) (adjacent ALA AMA)
    (adjacent PLA ALA) (adjacent ALA PLA)

    ;; Specify in which room the buffet is located
    (buffet BTA)
  )
  
  ;; Define the goal state

  (:goal
    (and 
      (at robot BTA)
      (served customer1) (at robot BTA) (at plate1 PMA)
    )
  )
)

; plan
1. (pick-up robot plate1 bta)
   added: (holding robot plate1) (hasplate robot)
   goals met: 2 of 4
2. (fill robot plate1 bta)
   added: (hasfood plate1)
   goals met: 2 of 4
3. (move_plate robot plate1 bta aua)
   deleted: (at robot bta) (at plate1 bta)
   added: (at robot aua) (at plate1 aua)
   goals met: 0 of 4
4. (move_plate robot plate1 aua pua)
   deleted: (at robot aua) (at plate1 aua)
   added: (at robot pua) (at plate1 pua)
   goals met: 0 of 4
5. (move_plate robot plate1 pua pma)
   deleted: (at robot pua) (at plate1 pua)
   added: (at robot pma) (at plate1 pma)
   goals met: 1 of 4
6. (present robot plate1 pma customer1)
   deleted: (holding robot plate1) (hasplate robot)
   added: (served customer1)
   goals met: 2 of 4
7. (move robot pma pua)
   deleted: (at robot pma)
   added: (at robot pua)
   goals met: 2 of 4
8. (move robot pua aua)
   deleted: (at robot pua)
   added: (at robot aua)
   goals met: 2 of 4
9. (move robot aua bta)
   deleted: (at robot aua)
   added: (at robot bta)
   goals met: 4 of 4
